final-versions/numbered/V0.0/benchmarks/k6-full-result-vis-1000.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /k6_benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 10m30s max duration (incl. graceful stop):
              * exact_requests: 25997 iterations shared among 1000 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m00.9s), 1000/1000 VUs, 347 complete and 0 interrupted iterations
exact_requests   [   1% ] 1000 VUs  00m00.9s/10m0s  00347/25997 shared iters

running (00m01.9s), 1000/1000 VUs, 4275 complete and 0 interrupted iterations
exact_requests   [  16% ] 1000 VUs  00m01.9s/10m0s  04275/25997 shared iters

running (00m02.9s), 1000/1000 VUs, 10977 complete and 0 interrupted iterations
exact_requests   [  42% ] 1000 VUs  00m02.9s/10m0s  10977/25997 shared iters

running (00m03.9s), 1000/1000 VUs, 17472 complete and 0 interrupted iterations
exact_requests   [  67% ] 1000 VUs  00m03.9s/10m0s  17472/25997 shared iters

running (00m04.9s), 1000/1000 VUs, 22139 complete and 0 interrupted iterations
exact_requests   [  85% ] 1000 VUs  00m04.9s/10m0s  22139/25997 shared iters

running (00m05.9s), 0253/1000 VUs, 25744 complete and 0 interrupted iterations
exact_requests   [  99% ] 1000 VUs  00m05.9s/10m0s  25744/25997 shared iters

running (00m06.9s), 0104/1000 VUs, 25893 complete and 0 interrupted iterations
exact_requests   [ 100% ] 1000 VUs  00m06.9s/10m0s  25893/25997 shared iters

running (00m07.9s), 0104/1000 VUs, 25893 complete and 0 interrupted iterations
exact_requests   [ 100% ] 1000 VUs  00m07.9s/10m0s  25893/25997 shared iters

running (00m08.9s), 0003/1000 VUs, 25994 complete and 0 interrupted iterations
exact_requests   [ 100% ] 1000 VUs  00m08.9s/10m0s  25994/25997 shared iters

running (00m09.9s), 0002/1000 VUs, 25995 complete and 0 interrupted iterations
exact_requests   [ 100% ] 1000 VUs  00m09.9s/10m0s  25995/25997 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 103988 10258.240289/s
    checks_succeeded...: 25.00% 25997 out of 103988
    checks_failed......: 75.00% 77991 out of 103988

    ✗ Success (200 OK)
      ↳  74% — ✓ 19347 / ✗ 6650
    ✗ Duplicate ID (409 Conflict)
      ↳  0% — ✓ 1 / ✗ 25996
    ✗ Sold Out (410 Gone)
      ↳  22% — ✓ 5967 / ✗ 20030
    ✗ Gateway/DB Error (500+)
      ↳  2% — ✓ 682 / ✗ 25315

    HTTP
    http_req_duration..............: avg=186.76ms min=89.05ms med=116.24ms max=9.7s   p(90)=190.39ms p(95)=338.01ms
      { expected_response:true }...: avg=147.42ms min=99.29ms med=117.53ms max=2.1s   p(90)=173.21ms p(95)=208.99ms
    http_req_failed................: 25.57% 6650 out of 25997
    http_reqs......................: 25997  2564.560072/s

    EXECUTION
    iteration_duration.............: avg=229.37ms min=89.17ms med=116.39ms max=10.08s p(90)=190.57ms p(95)=758.15ms
    iterations.....................: 25997  2564.560072/s
    vus............................: 2      min=2             max=1000
    vus_max........................: 1000   min=1000          max=1000

    NETWORK
    data_received..................: 6.2 MB 615 kB/s
    data_sent......................: 2.7 MB 269 kB/s



running (00m10.1s), 0000/1000 VUs, 25997 complete and 0 interrupted iterations
exact_requests ✓ [ 100% ] 1000 VUs  00m10.1s/10m0s  25997/25997 shared iters